[

    {
   
        
        "_id":"65b3aae3bc918440cb07c4de",

        "title":"Finance Director",
        "companyName":"Heath Ceramics",
        "about":"",
        "location":"San Francisco, CA",
        "jobType":"Remote",
        "salary":"2000",
        "tags":"#finnance #director",
        "aboutCompany":"Heath Ceramics is a California company making dinnerware and architectural tiles of good and enduring design for 75 years. We are design-led, with the mission of creating products of beauty and integrity, while designing, manufacturing, and running our business in a way that's better for society and our planet. Our products are designed, manufactured, and sold in our two California factories and four showrooms, ensuring accountability in our process, from beginning to end. As a Certified B Corp, we maintain high standards of social responsibility, environmental performance, and transparency. We believe in the benefits of local manufacturing and support a community of people committed to and inspired by the process of designing, making, and sharing. We believe in providing a living wage, full health and welfare benefits, and a place for meaningful work.",
        "positionSummary":"Heath is seeking a Finance Director, reporting directly to the Chief Operating Officer. This pivotal role leads the Finance team and is a key member of, and strategic partner to, the management team. The Finance VP/Director will lead and inspire teams toward financial goals and implement robust reporting systems to share financial information across departments, enabling informed decision-making.\n\nThe Finance team comprises an Accounting Manager who is a CPA, a Senior Accountant, and an A/P Accountant.\n\nWorking at Heath means a serious commitment to our regenerative business model and our dedication to craft, design, and Bay Area manufacturing. We go beyond the traditional capitalist focus of profitability and growth to actively improve the lives of our employees, the environment, and society's well-being. We embrace open-book management principles, transparency, and collaboration.",
        "Responsibilities":"",
        "responsibilities":"Develop and implement the accounting strategy and systems, including leading Netsuite development and preparing financial statements\nLead Heath’s annual budgeting process and track actuals departmentally and company-wide through delivering monthly financial reports, fostering a culture of financial responsibility among teams\nDrive transparency and understanding of Heath’s finances and financial strategies to employees, including monthly education sessions \nOversee financial forecasting, and cash flow management, ensuring adequate liquidity for operational needs\nLead financial planning and analysis, including financial modeling and scenario analysis\nManage relationships with banks, auditors, and other financial institutions\nProvide leadership and management to the Finance team, including setting the accounting department’s performance and goals",
        "qualifications":"Excellent knowledge of accounting, data analysis, modeling, and forecasting methods\nAbility to strategize and problem-solve\nStrong leadership and organizational skills\nExceptional communication and people skills to articulate financial concepts to non-finance teams\nStrong project management skills, including an ability to multitask, prioritize and respond quickly \nExcellent public speaking skills and the ability to teach Heath’s core economic drivers and how our actions influence them",
        "education":"Bachelor’s degree in Economics, Accounting, Finance, or related degree, or equivalent experience \n10+ years of FP&A experience in a manufacturing and retail environment\n5+ years of financial leadership experience\nHistory of scaling and process improvement for finance and accounting operations\nExpertise with Netsuite\nGreat Game of Business and Open Book Management experience preferred  ",
        "benifits":"At Heath, we don’t just accept differences — we celebrate it, we support it. Heath is proud to be an equal-opportunity workplace. Our goal is to be a diverse workforce at all job levels. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, transgender status, age, marital status, veteran status, or disability status."
     }
     
]
